Hmm, interesting. I'm not seeing that using the same provider version as you (5.1.0).

I'll quickly demonstrate what I'm seeing and then I'll make some suggestions for next steps. 

## What I'm seeing

First I create the service with a backend that has a `shield` property set...

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fastly_service_vcl.demo will be created
  + resource "fastly_service_vcl" "demo" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = true
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "testing-fastly-tf-prod-enablement-bug"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200

      + backend {
          + address               = "127.0.0.1"
          + auto_loadbalance      = false
          + between_bytes_timeout = 10000
          + connect_timeout       = 1000
          + error_threshold       = 0
          + first_byte_timeout    = 15000
          + max_conn              = 200
          + name                  = "localhost"
          + port                  = 80
          + shield                = "amsterdam-nl"
          + ssl_check_cert        = true
          + use_ssl               = false
          + weight                = 100
        }

      + domain {
          + name = "testing-fastly-tf-prod-enablement-bug.integralist.co.uk"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fastly_service_vcl.demo: Creating...
fastly_service_vcl.demo: Creation complete after 5s [id=SHk30ejeCHZbFUwSUhJPs4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

I then add the `product_enablement` block with `image_optimizer = true` and that applies fine...

```
fastly_service_vcl.demo: Refreshing state... [id=SHk30ejeCHZbFUwSUhJPs4]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fastly_service_vcl.demo will be updated in-place
  ~ resource "fastly_service_vcl" "demo" {
      ~ active_version     = 1 -> (known after apply)
      ~ cloned_version     = 1 -> (known after apply)
        id                 = "SHk30ejeCHZbFUwSUhJPs4"
        name               = "testing-fastly-tf-prod-enablement-bug"
        # (9 unchanged attributes hidden)

      + product_enablement {
          + brotli_compression = false
          + domain_inspector   = false
          + image_optimizer    = true
          + name               = (known after apply)
          + origin_inspector   = false
          + websockets         = false
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fastly_service_vcl.demo: Modifying... [id=SHk30ejeCHZbFUwSUhJPs4]
fastly_service_vcl.demo: Still modifying... [id=SHk30ejeCHZbFUwSUhJPs4, 10s elapsed]
fastly_service_vcl.demo: Modifications complete after 12s [id=SHk30ejeCHZbFUwSUhJPs4]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

Then lastly I set `image_optimizer = false` which applies successfully...

```
fastly_service_vcl.demo: Refreshing state... [id=SHk30ejeCHZbFUwSUhJPs4]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fastly_service_vcl.demo will be updated in-place
  ~ resource "fastly_service_vcl" "demo" {
      ~ active_version     = 2 -> (known after apply)
      ~ cloned_version     = 2 -> (known after apply)
        id                 = "SHk30ejeCHZbFUwSUhJPs4"
        name               = "testing-fastly-tf-prod-enablement-bug"
        # (9 unchanged attributes hidden)

      + product_enablement {
          + brotli_compression = false
          + domain_inspector   = false
          + image_optimizer    = false
          + name               = (known after apply)
          + origin_inspector   = false
          + websockets         = false
        }
      - product_enablement {
          - brotli_compression = false -> null
          - domain_inspector   = false -> null
          - image_optimizer    = true -> null
          - name               = "products" -> null
          - origin_inspector   = false -> null
          - websockets         = false -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fastly_service_vcl.demo: Modifying... [id=SHk30ejeCHZbFUwSUhJPs4]
fastly_service_vcl.demo: Still modifying... [id=SHk30ejeCHZbFUwSUhJPs4, 10s elapsed]
fastly_service_vcl.demo: Modifications complete after 15s [id=SHk30ejeCHZbFUwSUhJPs4]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

## Next steps

First I would recommend upgrading to https://github.com/fastly/terraform-provider-fastly/releases/tag/v5.2.1 as that version of the provider uses the updated go-fastly API client that should hopefully return better error information. Then when you run `terraform apply` prefix that with `TF_LOG=DEBUG` as that will show all the API calls the provider makes. 

I'd like to see the request/response for the API call that's disabling the Image Optimizer.

After that, I would recommend reaching out to support@fastly.com (or via Slack if you have access to a Fastly support Slack channel) and to reference this issue, as they'll be able to check your account access and see if there are any limitations/restrictions in place. 

But let's first see what log output you're getting back.

Thanks!